# 1 . Выведите все точные квадраты натуральных чисел, не превосходящие данного числа N.
#
# Входные данные
# Задано единственное целое число N
# Выходные данные
# Необходимо вывести  все точные квадраты натуральных чисел, не превосходящие данного числа N.
# Примеры
# входные данные
# 15
# выходные данные
# 1 4 9

if __name__ == '__main__':
    n = int(input())
    i = 1
    while i*i <= n and not print(i*i):
        i += 1

# "C:\Users\Dedy Rudney\exo-dossys\testvenv\Scripts\python.exe" "C:\Users\Dedy Rudney\exo-dossys\pratique3\exo1.py"
# 15
# 1
# 4
# 9
#
# Process finished with exit code 0
