# 8. Составить программу возведения натурального числа в квадрат, учитывая следующую закономерность:
#                              12=1,
#                              22=1+3,
#                              32=1+3+5,
#                              42=1+3+5+7,
#                              …
#                              n2=1+3+5+7+…+2·n-1.


def summation(n):
    return sum([i ** 2 for i in
                range(1, n + 1)])


# Driver Code
if __name__ == "__main__":
    n = 8
    print(summation(n))
    
# Input : n = 8
# Output : 204
# Explanation :
# 1^2 + 2^2 + 3^2 + 4^2 + 5^2 + 6^2 + 7^2 + 8^2 = 204